
/*/
 * 
 * 비트연산자
 * 
 * INT A=10;
 * A&=2 ====>A=10&2
 *  1010=>10
 *  0010=>2
 *  ---------&
 *  0010 =>2
 *
 * 
 *
 *
 *  byte와 int를 맞춰 주는 것-> 자동형변환
 * 
 * A|=2 ===>A=10|2
  A^=2; ====> A=10^2
 * 
 \
 * ------------------------
 *          &(*)   |(+)  ^(다른 비트) 
 * ------------------------
 * 00        0      0        0
 * ------------------------
 * 01        0     1          1
 * ------------------------
 * 10        0     1          1
 * ------------------------
 * 11       1      1          0
 * ------------------------
 * 
 * 
 * 
 * 
 * 
 */


public class 복합대입연산자_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		
		int a=10;
		a&=2; // a= 10&2 ==>a=2 복합연산자는 대입도 되기 때문에 초기화 필수
		System.out.println(a);
		
		a=10; // a값 초기화 필수
		a|=2;
		
		System.out.println(a);
		
		a=10;
		a^=2;
		System.out.println(a);

	}

}
